const express = require('express') ;
const art = require('art-template') ;
const app = express() ;

app.use('/public',express.static(__dirname+'/public')) ;
app.engine('art',require('express-art-template')) ;
app.set('view options',{
    debug:process.env.NODE_ENV!=='production'
}) ;

app.get('/', (req,res)=> {

    var industry_list = {
        "1": "金融业",
        "2": "IT|通信|互联网",
        "3": "机械机电|自动化",
        "4": "专业服务",
        "5": "冶金冶炼|五金|采掘",
        "6": "化工行业",
        "7": "纺织服装|皮革鞋帽",
        "8": "电子电器|仪器仪表",
        "9": "快消品|办公用品",
        "10": "房产|建筑|城建|环保",
        "11": "制药|医疗",
        "12": "生活服务|娱乐休闲",
        "13": "交通工具|运输物流",
        "14": "批发|零售|贸易",
        "15": "广告|媒体",
        "16": "教育|科研|培训",
        "17": "造纸|印刷",
        "18": "包装|工艺礼品|奢侈品",
        "19": "能源|资源",
        "20": "农|林|牧|渔",
        "21": "政府|非赢利机构|其他",
        "101": "基金\/证券\/期货\/投资",
        "102": "银行",
        "103": "保险",
        "104": "信托\/担保\/拍卖\/典当",
        "105": "金融租赁",
        "199": "其他",
        "201": "互联网\/电子商务",
        "202": "计算机服务(系统\/数据\/维护)",
        "203": "计算机软件",
        "204": "计算机硬件",
        "205": "网络游戏",
        "206": "通信\/电信\/网络设备",
        "207": "通信\/电信运营、增值服务",
        "208": "电子技术\/半导体\/集成电路",
        "299": "其他",
        "301": "机床及附件",
        "302": "行业机械设备",
        "303": "专用机械设备",
        "304": "动力电力机电设备",
        "305": "工业自动化",
        "399": "其他",
        "401": "会展及活动服务",
        "402": "财务\/审计\/税务",
        "403": "管理咨询",
        "404": "人力资源",
        "405": "法律服务",
        "406": "技术服务",
        "407": "检测认证",
        "408": "租赁服务",
        "409": "中介服务",
        "410": "外包服务",
        "411": "翻译服务",
        "499": "其他",
        "501": "冶金冶炼业",
        "502": "五金工具",
        "503": "不锈钢\/铝合金\/金属制品",
        "504": "采掘业",
        "599": "其他",
        "601": "石油化工",
        "602": "化工原料及产品",
        "603": "涂料\/油墨\/颜料\/染料",
        "604": "橡胶塑料及制品",
        "605": "玻璃\/陶瓷",
        "699": "其他",
        "701": "纺织及成品",
        "702": "印染、染整",
        "703": "服装",
        "704": "皮革、羊毛、羽绒制品",
        "705": "鞋帽",
        "799": "其他",
        "801": "电气设备",
        "802": "电子器件",
        "803": "电工器材",
        "804": "照明工业",
        "805": "数码家电",
        "806": "仪器仪表",
        "899": "其他",
        "901": "快速消费品",
        "902": "办公用品及设备",
        "999": "其他",
    };

    res.render('index.art',{
        industry_list,
    })

});



app.listen(4000,()=>{console.log('服务器已启动')}) ;

