/*

编译原理
1.理解代码到底是什么，计算机如何将代码转换为可以运行的目标程序
2.正则表达式的匹配原理和性能优化
3.如何将JavaScript代码解析成抽象语法树(AST)
4.base64的编码原理
5.几种进制的相互转换计算方法，在JavaScript中如何表示和转换

设计模式
1.熟练使用前端常用的设计模式编写代码，如单例模式、装饰器模式、代理模式等
2.发布订阅模式和观察者模式的异同以及实际应用
3.可以说出几种设计模式在开发中的实际应用，理解框架源码中对设计模式的应用

JavaScript编码能力
1.多种方式实现数组去重、扁平化、对比优缺点
2.多种方式实现深拷贝、对比优缺点
3.手写函数柯里化工具函数、并理解其应用场景和优势
4.手写防抖和节流工具函数、并理解其内部原理和应用场景
5.实现一个sleep函数

手动实现前端轮子
1.手动实现call、apply、bind
2.手动实现符合Promise/A+规范的Promise、手动实现async await
3.手写一个EventEmitter实现事件发布、订阅
4.可以说出两种实现双向绑定的方案、可以手动实现
5.手写JSON.stringify、JSON.parse
6.手写一个模版引擎，并能解释其中原理
7.手写懒加载、下拉刷新、上拉加载、预加载等效果

实用库
1.至少掌握一种UI组件框架，如antd design，理解其设计理念、底层实现
2.掌握一种图表绘制框架，如Echart，理解其设计理念、底层实现，可以自己实现图表
3.掌握一种GIS开发框架，如百度地图API
4.掌握一种可视化开发框架，如Three.js、D3
5.工具函数库，如lodash、underscore、moment等，理解使用的工具类或工具函数的具体实现原理




*/