/*

* 1.原油产品总产量的90%是燃料，能源的主要供应者
原油产品，主要指原油炼制生产的汽油、煤油、柴油、重油以及天然气，是当前主要能源的主要供应者。原油产品提供的能源主要作汽车、拖拉机、飞机、轮船、锅炉的燃料，少量用作民用燃料。
原油产品是材料工业的支柱之一
原油
原油
金属、无机非金属材料和高分子合成材料，被称为三大材料。全世界原油化工提供的高分子合成材料产量约1.45亿吨。除合成材料外，石油产品还提供了绝大多数的有机化工原料，在属于化工领域的范畴内，除化学矿物提供的化工产品外，石油产品生产的原料，在各个部门大显身手。
各工业部门离不开原油产品
现代交通工业的发展与燃料供应息息相关，可以毫不夸张地说，没有燃料，就没有现代交通工业。金属加工、各类机械毫无例外需要各类润滑材料及其它配套材料，消耗了大量原油产品。建材工业是原油产品的新领域，如塑料管材、门窗、铺地材料、涂料被称为化学建材。轻工、纺织工业是石油产品的传统用户，新材料、新工艺、新产品的开发与推广，无不有原油产品的身影。
原油产品促进了农业的发展
农业是我国国民经济的基础产业。石油工业提供的氮肥占化肥总量的80%，农用塑料薄膜的推广使用，加上农药的合理使用以及大量农业机械所需各类燃料，形成了石油工业支援农业的主力军。

*/